"""Script to add test questions to the database."""

import asyncio
from datetime import datetime

from sqlalchemy.ext.asyncio import create_async_engine

from mentor_bot.config import get_settings
from mentor_bot.db.models import Question

questions = [
# Этап 1 — Основы Python
{
"text": "Чем отличаются интерпретатор и компилятор? Как запускается код на Python и что при этом происходит?",
"category": "Основы Python",
},
{
"text": "Как Python управляет памятью? Как работает сборщик мусора?",
"category": "Основы Python",
},
{
"text": "Какие типы данных есть в Python и на какие категории их можно разделить? Чем отличаются кортеж и список? Какая сложность операции добавления элемента в список?",
"category": "Основы Python",
},
{
"text": "Как устроены словари и что может быть ключом словаря? Что такое хэш-таблица и могут ли разные объекты иметь одинаковый хэш?",
"category": "Основы Python",
},
{
"text": "Что такое функция и какую функцию называют чистой? Что такое анонимная функция?",
"category": "Основы Python",
},
{
"text": "Что такое область видимости и как работает замыкание?",
"category": "Основы Python",
},
{
"text": "Что такое декоратор? Что может декоратор и к чему он может быть применен?",
"category": "Основы Python",
},
{
"text": "Что такое итератор, итерируемый объект и генератор? Какие методы есть у генератора?",
"category": "Основы Python",
},
{
"text": "Что такое ООП и какие основные принципы ООП? Что такое MRO и super?",
"category": "Основы Python",
},
{
"text": "Что такое методы класса и статические методы? Какие методы называют абстрактными? Что такое slots?",
"category": "Основы Python",
},
{
"text": "Что такое магические методы? Какие магические методы вызываются при создании экземпляра класса? Какие магические методы есть у контекстного менеджера и для чего он нужен?",
"category": "Основы Python",
},
{
"text": "Что такое дескрипторы? Как при вызове метода из экземпляра класса экземпляр передается в метод первым аргументом (self)? Для чего используется property?",
"category": "Основы Python",
},
{
"text": "Что такое SOLID?",
"category": "Основы Python",
},
{
"text": "Для каких целей и типов запросов используется кеширование?",
"category": "Основы Python",
},
{
"text": "Каких проблем помогают избежать очереди (брокеры сообщений)?",
"category": "Основы Python",
},
{
"text": "Что такое DDD? Для чего полезны паттерны репозиторий и единица работы?",
"category": "Основы Python",
},

# Этап 2 — БД
{
    "text": "Что такое БД и СУБД? Какие БД называют реляционными? Как устанавливаются связи между таблицами и какие они бывают?",
    "category": "БД",
},
{
    "text": "Что такое соединения в SQL? Какие соединения бывают?",
    "category": "БД",
},
{
    "text": "Что такое индексы и как они влияют на запросы? Чем отличаются кластеризованные и некластеризованные индексы? Какие типы индексов бывают и какой используется в PostgreSQL по умолчанию?",
    "category": "БД",
},
{
    "text": "Что такое селективность колонки и как она влияет на планировщик запросов? Что такое EXPLAIN и EXPLAIN ANALYZE?",
    "category": "БД",
},
{
    "text": "Что такое подзапрос и какие типы подзапросов бывают? Что такое CTE?",
    "category": "БД",
},
{
    "text": "Какой порядок построения SQL-запроса? Что такое агрегатные функции и оконные функции?",
    "category": "БД",
},
{
    "text": "В чем отличие между DDL, DML, DCL и TCL? Какие операции входят в каждую из групп? Чем отличается DELETE от TRUNCATE?",
    "category": "БД",
},
{
    "text": "Что такое ограничения (constraints) в SQL, какие основные типы существуют?",
    "category": "БД",
},
{
    "text": "Что такое курсор и зачем он нужен?",
    "category": "БД",
},
{
    "text": "Что такое VACUUM в PostgreSQL?",
    "category": "БД",
},
{
    "text": "Что такое ORM? Что такое Metadata в SQLAlchemy?",
    "category": "БД",
},
{
    "text": "Как оптимизируют медленные запросы? Что такое проблема N+1 и как она решается в SQLAlchemy?",
    "category": "БД",
},
{
    "text": "Что такое SQL-инъекции и как их избежать?",
    "category": "БД",
},
{
    "text": "Что такое партиционирование, репликация и шардирование?",
    "category": "БД",
},
{
    "text": "Что такое транзакция и вложенная транзакция? Что такое ACID? Какие уровни изоляции существуют?",
    "category": "БД",
},

# Этап 3 — Django
{
    "text": "Что такое Django и для чего используется? Какова архитектура Django, какие основные компоненты она включает?",
    "category": "Django",
},
{
    "text": "Какие шаги необходимо выполнить для создания и конфигурации проекта и приложения в Django, включая примеры команд и нюансы настройки? Как подключить статические файлы, настроить работу с изображениями? Что будет, если поменять SECRET_KEY? Как настроить Django для работы с асинхронными запросами?",
    "category": "Django",
},
{
    "text": "Что такое модель Django и какой механизм связывает ее с базой данных? Как описываются отношения «один ко многим» и «многие ко многим» в моделях Django? Как настроить Django для работы с несколькими базами данных? Как в Django реализуются транзакции в базах данных?",
    "category": "Django",
},
{
    "text": "Что такое представление (view) в Django и какие типы представлений существуют?",
    "category": "Django",
},
{
    "text": "Как Django обрабатывает запросы? Как добавлять URL-маршрут? Что такое шаблоны Django? Как работает функция render в Django?",
    "category": "Django",
},
{
    "text": "Что такое формы в Django?",
    "category": "Django",
},
{
    "text": "Как реализовать систему аутентификации в Django? Как работает система сессий в Django? Что такое Permission и Group в Django? Как настроить административную панель в Django? Как создать команду управления Django, например, для создания суперпользователя?",
    "category": "Django",
},
{
    "text": "Что такое middleware в Django? Как настроить CSRF?",
    "category": "Django",
},
{
    "text": "Что такое сигналы в Django?",
    "category": "Django",
},
{
    "text": "Как настроить мультиязычность в Django?",
    "category": "Django",
},
{
    "text": "Что такое менеджеры моделей и как их использовать? Что такое Queryset? Какая разница между only, values и values_list? Что такое Q-объекты и F-выражения? В чем разница между annotate и aggregate?",
    "category": "Django",
},
{
    "text": "Как использовать систему тестирования Django?",
    "category": "Django",
},
{
    "text": "Что такое DRF? Что такое Viewset и какие методы поддерживает? Как дать разный доступ в рамках одного Viewset разным методам? Зачем нужен декоратор action?",
    "category": "Django",
},
{
    "text": "Как в DRF создать свой Permission? Как настроить throttling?",
    "category": "Django",
},
{
    "text": "Какие ты знаешь методы оптимизации производительности для Django? Как настроить кэширование? В чем отличие select_related и prefetch_related?",
    "category": "Django",
},

# Этап 4 — Asyncio
{
    "text": "Что такое GIL и для чего он нужен? Участвует ли он в выполнении асинхронного кода?",
    "category": "Asyncio",
},
{
    "text": "Что такое конкурентность и параллельность? Какие задачи решают многопоточность, многопроцессность и асинхронность?",
    "category": "Asyncio",
},
{
    "text": "Что такое корутина и чем она отличается от обычной функции?",
    "category": "Asyncio",
},
{
    "text": "Что такое event loop и как он управляет выполнением асинхронных задач?",
    "category": "Asyncio",
},
{
    "text": "Как связаны генераторы с асинхронным кодом?",
    "category": "Asyncio",
},
{
    "text": "Как выполнить последовательный, фоновый и групповой запуск асинхронных задач? В чем различия?",
    "category": "Asyncio",
},
{
    "text": "Что такое асинхронный итератор и асинхронный контекстный менеджер?",
    "category": "Asyncio",
},
{
    "text": "Как можно управлять временем исполнения корутины?",
    "category": "Asyncio",
},
{
    "text": "Как создать объект asyncio.Future и для чего он используется?",
    "category": "Asyncio",
},
{
    "text": "Что такое примитивы синхронизации и какие существуют в асинхронном программировании?",
    "category": "Asyncio",
},
{
    "text": "Что такое asyncio.Queue, в чем преимущества перед стандартными очередями?",
    "category": "Asyncio",
},
{
    "text": "Как работает проброс исключений в асинхронности?",
    "category": "Asyncio",
},
{
    "text": "Как выполняется синхронный блок кода в асинхронном программировании?",
    "category": "Asyncio",
},

# Этап 5 — FastAPI
{
    "text": "Что такое FastAPI и для каких задач он предназначен?",
    "category": "FastAPI",
},
{
    "text": "Как устроена система маршрутов в FastAPI? В чем разница между path, query и request body параметрами?",
    "category": "FastAPI",
},
{
    "text": "Как работает механизм зависимостей в FastAPI? В чем разница между синхронными и асинхронными зависимостями?",
    "category": "FastAPI",
},
{
    "text": "Как организовать middleware в FastAPI? Как их применить для аутентификации, логирования и кэширования? Как настроить CORS?",
    "category": "FastAPI",
},
{
    "text": "Как FastAPI обрабатывает исключения?",
    "category": "FastAPI",
},
{
    "text": "Как реализовать поддержку websockets в FastAPI?",
    "category": "FastAPI",
},
{
    "text": "Как работает BackgroundTasks в FastAPI? Какие есть альтернативы?",
    "category": "FastAPI",
},
{
    "text": "Что такое lifespan в FastAPI?",
    "category": "FastAPI",
},
{
    "text": "Что такое Pydantic и как он интегрируется с FastAPI? Какие есть преимущества и недостатки у Pydantic?",
    "category": "FastAPI",
},
{
    "text": "Как создается модель Pydantic и какие ключевые примитивы используются для определения ее полей? Для чего используется Field() в Pydantic?",
    "category": "FastAPI",
},
{
    "text": "Чем отличаются BaseModel и dataclass в Pydantic?",
    "category": "FastAPI",
},
{
    "text": "Как Pydantic осуществляет валидацию данных? Как создать свой валидатор? Какие валидаторы бывают и для каких целей используются? Какие значения может принимать параметр mode?",
    "category": "FastAPI",
},
{
    "text": "Как происходит сериализация и десериализация в Pydantic? Как ей можно управлять? Какие методы есть для сериализации и десериализации?",
    "category": "FastAPI",
},
{
    "text": "Как использовать атрибут model_config для изменения поведения моделей, включая работу с ORM и поддержку case-insensitive алиасов?",
    "category": "FastAPI",
},
{
    "text": "Как использовать Pydantic для работы с .env-файлами, настройками конфигурации и секретами?",
    "category": "FastAPI",
},

# Этап 6 — Pytest
{
    "text": "Что такое Pytest и каковы его преимущества?",
    "category": "Pytest",
},
{
    "text": "Как Pytest запускает тесты? Как запустить тесты из конкретного файла или директории? Какие файлы конфигурации поддерживает Pytest?",
    "category": "Pytest",
},
{
    "text": "Что такое фикстуры? Как использовать фикстуру в тесте? Может ли одна фикстура использовать другую фикстуру? Что такое scope? Чем отличается yield от return в фикстурах?",
    "category": "Pytest",
},
{
    "text": "Что такое маркирование? Как увидеть список всех доступных маркеров? Как пометить тест и как запустить тест с определенным маркером?",
    "category": "Pytest",
},
{
    "text": "Что такое параметризация тестов и зачем она нужна?",
    "category": "Pytest",
},
{
    "text": "Для чего используется pytest.raises? Как его использовать для проверки исключений с дополнительными атрибутами? Что будет с тестом, если внутри блока with не будет выброшено исключение?",
    "category": "Pytest",
},
{
    "text": "Как тестировать асинхронный код?",
    "category": "Pytest",
},
{
    "text": "Что делает опция --maxfail в тестах? Как использовать --pdb для отладки падающих тестов?",
    "category": "Pytest",
},
{
    "text": "Как ограничить время выполнения теста? Как ускорить время выполнения тестов?",
    "category": "Pytest",
},
{
    "text": "Как запустить тесты и записать отчет в файл? Чем отличается pytest-cov от coverage.py и когда их использовать? Какой формат отчета покрытия (term, html, xml) более информативен для разработчика и почему? Почему процент покрытия не всегда является показателем качества тестов?",
    "category": "Pytest",
},
{
    "text": "Какие есть способы пропустить тест и как их использовать? Как отключить вывод пропущенных тестов? Почему пропуск тестов может исказить отчет о покрытии?",
    "category": "Pytest",
},
{
    "text": "Что такое мокирование в тестировании и зачем оно нужно? Какая фикстура предоставляется pytest-mock и чем она удобна? Как проверить, был ли вызван метод с определенными аргументами или что функция вызывалась определенное количество раз?",
    "category": "Pytest",
},
{
    "text": "Для чего используется Pytest-benchmark?",
    "category": "Pytest",
},
{
    "text": "Что такое TDD? Каковы его преимущества и недостатки?",
    "category": "Pytest",
},

]

async def add_test_questions() -> None:
    """Add test questions to the database."""
    settings = get_settings()
    engine = create_async_engine(settings.DATABASE_URL, echo=True)

    now = datetime.utcnow()

    questions_to_insert = [
        {
            **question,
            "is_active": True,
            "created_at": now,
            "updated_at": now,
        }
        for question in questions
    ]

    async with engine.begin() as conn:
        await conn.run_sync(
            lambda sync_conn: sync_conn.execute(
                Question.__table__.insert(),
                questions_to_insert,
            )
        )

    await engine.dispose()

    print(f"Успешно добавлено вопросов: {len(questions_to_insert)}")


if __name__ == "__main__":
    asyncio.run(add_test_questions())
